// F2 ДЗ 2
// Четные в начало
// Написать функцию и программу, демонстрирующую работу данной функции,
// которая ставит в начало массива все четные элементы, а в конец – все нечетные.
// Не нарушайте порядок следования чисел между собой. Строго согласно прототипу:
// void sort_even_odd(int n, int a[])

// Данные на входе: 		Функция принимает на вход целые числа 
// Данные на выходе: 	    Отсортированный исходный массив 

// Пример №1
// Данные на входе: 		20 19 18 17 16 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 
// Данные на выходе: 	    20 18 16 14 12 10 8 6 4 2 19 17 15 13 11 9 7 5 3 1 

// Пример №2
// Данные на входе: 		1 0 1 0 1 
// Данные на выходе: 	    0 0 1 1 1


#include <stdio.h>
#define SIZE 20

void arrShow(int* a, int n)
{
    for (size_t i = 0; i < n; ++i)
        printf("%d ", a[i]);
    printf("\n");
}

void arrInput(int* a, int n)
{ 
    for(size_t i = 0; i < n; ++i) 
        scanf("%d", &a[i]);
}

void sort_even_odd(int n, int a[])
{
    for (size_t j = 0; j < n - 1; ++j)
    {
        for (size_t i = (j + 1), t; i < n - 1; --i)
        {   
            if (a[i] % 2 != 0)
                if ((a[i+1] % 2) == 0)
                {
                    t = a[i];
                    a[i] = a[i+1];
                    a[i+1] = t;
                }
        }
    }
}

int main(void)
{
int a[SIZE];
int n;

    arrInput(a, SIZE);
    sort_even_odd(SIZE, a);
    arrShow(a, SIZE);
    return 0;
}