// D16 Практик 3
// Точная степень двойки
// Написать логическую рекурсивную функцию и используя ее определить является ли введенное натуральное число точной степенью двойки.
// int is2pow(int n)
// Данные на входе: 		Одно натуральное число. 
// Данные на выходе: 	YES или NO 

// Пример №1
// Данные на входе: 		8 
// Данные на выходе: 	YES 

// Пример №2
// Данные на входе: 		7 
// Данные на выходе: 	NO 



#include <stdio.h>
 
// int is2pow(int n)
// {
// int input;
//     scanf("%d", &input);
//     if (input == 0)
//         return 0;
//     all_even();
//     if (input % 2 > 0)
//         printf("%d ", input);
// }
 
int main()
{
int a = 0;
    printf("%d \n", 2 << 1);
    // scanf("%d", &a);
    // is2pow(a);


    return 0;
}
