// C15 Практ 
// Цифры по возрастанию

// Составить функцию логическую функцию,
// которая определяет, верно ли, что в заданном числе все цифры стоят по возрастанию. Используя данную функцию решить задачу.

// int grow_up(int n)

// Данные на входе: 		Одно целое не отрицательное число 
// Данные на выходе: 	YES или NO 

// Пример №1
// Данные на входе: 		258 
// Данные на выходе: 	YES 

// Пример №2
// Данные на входе: 		528 
// Данные на выходе: 	NO 


#include <stdio.h>

int grow_up(int a)
{
    for (int resalt = 10; a > 0; a /= 10)
    {
        if (resalt >= a % 10) resalt = a % 10;
            else return 1;
    }
    return 0;
}
int main(void)
{
unsigned int a;

    scanf("%d", &a);

    grow_up(a) ? puts("NO") : puts("YES");
    return 0;
}
