// Кратность прежде всего
// В диапазоне натуральных чисел от 2 до N определить, сколько из них кратны любому из чисел в диапазоне от 2 до 9. 

// Данные на входе: 		Одно целое число N большее 2 и не превосходящее 10000 
// Данные на выходе: 	Все числа от 2 до 9 в формате: 2 количество чисел кратных 2\n 3
// количество чисел кратных 3\n 4 количество чисел кратных 4\n 5 количество чисел кратных 
// 5\n 6 количество чисел кратных 6\n 7 количество чисел кратных 7\n 8 количество чисел кратных 8\n 9 количество чисел кратных 9 

// Пример №1
// Данные на входе: 		99 
// Данные на выходе: 	
// 2 49 
// 3 33
// 4 24 
// 5 19 
// 6 16
// 7 14 
// 8 12 
// 9 11 

// Пример №2
// Данные на входе: 		9 
// Данные на выходе: 	
// 2 4 
// 3 3 
// 4 2 
// 5 1 
// 6 1 
// 7 1 
// 8 1 
// 9 1 



#include <stdio.h>
int main() 
{
int n;
scanf("%d",&n);
for (int i = 2; i <= 9; ++i)
{
    printf("%d %d\n", i, n/i);
}
return 0;
}

